{
  "generatedAt": "2026-07-17T17:46:45.811277+00:00",
  "counts": {
    "total": 2060,
    "learning": 1206,
    "known": 854
  },
  "keywords": [
    "1980s",
    "80",
    "abandon",
    "abdominal",
    "ability",
    "able",
    "abnormal",
    "about",
    "above",
    "abs",
    "absence",
    "absenteeism",
    "absolutely",
    "absorb",
    "academic",
    "accept",
    "access",
    "accessible",
    "accompany",
    "according",
    "accustomed",
    "achieve",
    "achievement",
    "acknowledge",
    "acme",
    "acquire",
    "across",
    "act",
    "acting",
    "action",
    "activation",
    "active",
    "activities",
    "actor",
    "actually",
    "add",
    "addition",
    "adjective",
    "adjective/noun",
    "adjust",
    "administration",
    "admit",
    "adopted",
    "adult",
    "advance",
    "advanced",
    "adventure",
    "adverb",
    "adverb-+-verb",
    "adverbial-phrase",
    "advice",
    "advisor",
    "aesthetically",
    "affair",
    "affairs",
    "affect",
    "affected",
    "affection",
    "after",
    "afterwards",
    "again",
    "against",
    "age",
    "agenda",
    "agent",
    "ages",
    "ago",
    "agree",
    "agreed",
    "agreement",
    "aim",
    "air",
    "airplane",
    "album",
    "alien",
    "all",
    "alleged",
    "allegedly",
    "allow",
    "alone",
    "along",
    "already",
    "also",
    "alter",
    "although",
    "alumna",
    "alumnus",
    "always",
    "am",
    "amazing",
    "ambitious",
    "america",
    "among",
    "amount",
    "ample",
    "amusement",
    "analysis",
    "ancient",
    "angel",
    "anger",
    "announce",
    "announcer",
    "another",
    "answer",
    "answers",
    "ants",
    "anxious",
    "any",
    "apart",
    "apologize",
    "app",
    "appearance",
    "applet",
    "application",
    "appointment",
    "appropriate",
    "approximately",
    "apt",
    "arbitrarily",
    "archive",
    "ardently",
    "are",
    "area",
    "arise",
    "arm",
    "armed",
    "army",
    "around",
    "arouse",
    "arrange",
    "arrive",
    "arrogant",
    "article",
    "articulate",
    "artist",
    "ascertain",
    "ask",
    "askew",
    "aspects",
    "assessment",
    "assistance",
    "assistant",
    "astronaut",
    "atmosphere",
    "ato",
    "attempt",
    "attend",
    "attendance",
    "attention",
    "attentiveness",
    "attitude",
    "attract",
    "attractive",
    "audition",
    "aunt",
    "authorities",
    "authorization",
    "authorize",
    "auxiliary-verb",
    "available",
    "avoid",
    "awaken",
    "aware",
    "away",
    "awesome",
    "awkward",
    "back",
    "bad",
    "ball",
    "ballet",
    "balloon",
    "bank",
    "banks",
    "banquet",
    "barrage",
    "barrier",
    "based",
    "bashful",
    "basis",
    "battle",
    "beam",
    "bear",
    "beast",
    "beautiful",
    "beauty",
    "became",
    "because",
    "become",
    "before",
    "begin",
    "beginning",
    "behave",
    "behind",
    "being",
    "beings",
    "believe",
    "belong",
    "belt",
    "bend",
    "beside",
    "besides",
    "beta",
    "betray",
    "between",
    "beyond",
    "big",
    "biological",
    "birthday",
    "bit",
    "black",
    "blackboard",
    "bless",
    "blessed",
    "blindly",
    "blocking",
    "blogger",
    "blood",
    "bloodthirsty",
    "blows",
    "bludgeon",
    "blue",
    "bluff",
    "blurry",
    "board",
    "boast",
    "boat",
    "body",
    "bodyguard",
    "bodyweight",
    "boiled",
    "bones",
    "book",
    "boring",
    "born",
    "boss",
    "both",
    "bottle",
    "bottom",
    "boundary",
    "boundless",
    "bounty",
    "box",
    "br",
    "brain",
    "branch",
    "brand",
    "brave",
    "bravely",
    "braver",
    "break",
    "breakdown",
    "breakthrough",
    "bright",
    "brightened",
    "brim",
    "bring",
    "broadcast",
    "broadcaster",
    "broken",
    "brought",
    "bud",
    "buddhism",
    "build",
    "building",
    "burn",
    "burning",
    "burst",
    "bury",
    "business",
    "but",
    "buttocks",
    "cabin",
    "cactus",
    "calamity",
    "called",
    "calm",
    "can",
    "can't",
    "cancer",
    "candidate",
    "cannot",
    "cantonese",
    "capability",
    "capricious",
    "captivate",
    "car",
    "care",
    "career",
    "carefree",
    "careful",
    "carnival",
    "carries",
    "carry",
    "carrying",
    "carved",
    "case",
    "cast",
    "catastrophe",
    "catch",
    "cattle",
    "cause",
    "cease",
    "ceaselessly",
    "celebrities",
    "celebrity",
    "center",
    "century",
    "certain",
    "certainly",
    "champion",
    "championship",
    "champs",
    "chance",
    "change",
    "changed",
    "channel",
    "chant",
    "character",
    "characteristic",
    "characters",
    "charm",
    "chart",
    "chase",
    "chat",
    "cheap",
    "cheat",
    "cheater",
    "cheats",
    "check",
    "cheek",
    "cheer",
    "chef",
    "cheque",
    "cherish",
    "chief",
    "child",
    "childhood",
    "children",
    "china",
    "chinese",
    "choice",
    "chongqing",
    "choose",
    "chopin",
    "chopping",
    "chopsticks",
    "circle",
    "circuit",
    "circumstances",
    "citizens",
    "city",
    "claim",
    "clan",
    "class",
    "classroom",
    "clean",
    "clear",
    "clearance",
    "clearly",
    "clever",
    "click",
    "client",
    "cliff",
    "climb",
    "clock",
    "clooney",
    "close",
    "closeness",
    "clothes",
    "cloud",
    "clouds",
    "cloudy",
    "clumsy",
    "coarse",
    "coaster",
    "code",
    "coffee",
    "coincidental",
    "cold",
    "collaborate",
    "collagen",
    "collar",
    "colleagues",
    "college",
    "color",
    "column",
    "comb",
    "combination",
    "come",
    "comedian",
    "comedy",
    "command",
    "commemorate",
    "comment",
    "comments",
    "commercial",
    "commercialization",
    "commit",
    "committee",
    "common",
    "commonly",
    "communicate",
    "communicated",
    "communication",
    "companies",
    "companion",
    "company",
    "compare",
    "compatriots",
    "competition",
    "competitiveness",
    "compilation",
    "complacent",
    "complain",
    "complement",
    "complete",
    "completed",
    "completely",
    "completion",
    "complication",
    "components",
    "composition",
    "comprehend",
    "comprehensive",
    "compress",
    "computation",
    "compute",
    "computer",
    "computing",
    "conceal",
    "concept",
    "concerning",
    "concerns",
    "conclude",
    "conclusive",
    "concrete",
    "condition",
    "conduct",
    "confession",
    "confidence",
    "confine",
    "confirm",
    "conflict",
    "confront",
    "confucianism",
    "conjunction",
    "connect",
    "connected",
    "connotation",
    "conquer",
    "consent",
    "consider",
    "considerate",
    "considered",
    "consist",
    "consists",
    "constantly",
    "constitute",
    "construct",
    "construction",
    "consumption",
    "contact",
    "container",
    "containerization",
    "content",
    "context",
    "contexts",
    "continue",
    "continuously",
    "contradiction",
    "contrary",
    "control",
    "conveniently",
    "convention",
    "convey",
    "cooking",
    "cool",
    "cooperate",
    "copy",
    "core",
    "corner",
    "corners",
    "corpse",
    "correct",
    "cough",
    "count",
    "countdown",
    "countless",
    "couple",
    "courage",
    "courier",
    "course",
    "court",
    "cover",
    "cows",
    "crack",
    "crackdown",
    "crafty",
    "crash",
    "create",
    "creation",
    "creativity",
    "creator",
    "creed",
    "crescent",
    "crime",
    "criminal",
    "criminal's",
    "criminals",
    "criticize",
    "critique",
    "crooked",
    "cross",
    "crow",
    "crowded",
    "crucial",
    "cruel",
    "cry",
    "cuisine",
    "cultivation",
    "curbed",
    "cure",
    "cured",
    "current",
    "currently",
    "curse",
    "curve",
    "customer",
    "customs",
    "cute",
    "cutting",
    "daily",
    "daily-life",
    "damage",
    "damn",
    "dance",
    "danger",
    "daoism",
    "dare",
    "dark",
    "darkness",
    "dashing",
    "data",
    "database",
    "date",
    "dating",
    "day",
    "days",
    "daze",
    "de",
    "dead",
    "deadlift",
    "deaf",
    "deal",
    "dear",
    "death",
    "deceased",
    "deceive",
    "decent",
    "decide",
    "declare",
    "decompress",
    "decrease",
    "dedicate",
    "deep",
    "deepest",
    "deeply",
    "defeat",
    "defending",
    "definite",
    "definitely",
    "definition",
    "degenerate",
    "degree",
    "delay",
    "delete",
    "deliberately",
    "delicate",
    "delicious",
    "delightful",
    "deliver",
    "delivery",
    "deltoid",
    "demand",
    "demon",
    "den",
    "density",
    "department",
    "depend",
    "depict",
    "describe",
    "deserve",
    "designer",
    "desire",
    "despicable",
    "destined",
    "destiny",
    "destroy",
    "detailed",
    "details",
    "detain",
    "deter",
    "determine",
    "deterrence",
    "development",
    "devices",
    "devil",
    "devote",
    "di",
    "diary",
    "die",
    "difference",
    "different",
    "difficult",
    "difficulty",
    "diligent",
    "diligently",
    "dim",
    "direction",
    "directly",
    "director",
    "dirty",
    "disappear",
    "disaster",
    "discard",
    "discover",
    "discrepancy",
    "discuss",
    "discussed",
    "discussion",
    "disgrace",
    "disguise",
    "dishes",
    "disobey",
    "dispatch",
    "display",
    "disposal",
    "dispute",
    "disregard",
    "disrupt",
    "dissipate",
    "dissolve",
    "dissuade",
    "distance",
    "distant",
    "distinct",
    "distinguish",
    "distributed",
    "disturb",
    "divides",
    "do",
    "doctoral",
    "does",
    "doesn't",
    "dog",
    "dominate",
    "don't",
    "doubles",
    "dove",
    "down",
    "doze",
    "drag",
    "dragonfly",
    "drama",
    "draw",
    "drawing",
    "dread",
    "dream",
    "dreams",
    "dregs",
    "dress",
    "dressed",
    "drop",
    "drops",
    "dry",
    "due",
    "dug",
    "dull",
    "dumbbell",
    "duty",
    "each",
    "eagerly",
    "early",
    "earn",
    "earnestly",
    "earthquake",
    "ease",
    "easily",
    "easy",
    "eater",
    "echo",
    "economics",
    "economy",
    "edge",
    "edges",
    "effect",
    "effective",
    "efficiency",
    "efficient",
    "effort",
    "eight",
    "either",
    "electronics",
    "elegant",
    "elite",
    "eloquent",
    "elys",
    "embark",
    "embarrassed",
    "embed",
    "embedded",
    "embrace",
    "embracing",
    "emoticon",
    "emotion",
    "emotional",
    "emotions",
    "emperor",
    "emphasis",
    "emphasize",
    "employ",
    "employee",
    "empty",
    "encircle",
    "encounter",
    "end",
    "endeavor",
    "ending",
    "endless",
    "endure",
    "enemy",
    "energetically",
    "energy",
    "engaged",
    "engraved",
    "enhance",
    "enjoy",
    "enjoying",
    "enormous",
    "enough",
    "enroll",
    "enrollment",
    "ensure",
    "entangle",
    "enter",
    "entering",
    "enterprise",
    "entertainment",
    "enthusiasm",
    "enthusiastic",
    "entire",
    "entity",
    "entrance",
    "entry",
    "environment",
    "epidemic",
    "episode",
    "equivalent",
    "era",
    "erase",
    "es",
    "escape",
    "especially",
    "essence",
    "establish",
    "eternal",
    "ethics",
    "europe",
    "evaluation",
    "even",
    "evening",
    "event",
    "events",
    "ever",
    "every",
    "everyday",
    "everyone",
    "everything",
    "evidence",
    "evident",
    "exactly",
    "exam",
    "examination",
    "examinations",
    "examine",
    "example",
    "exceed",
    "excel",
    "excellent",
    "exceptional",
    "excessive",
    "exchange",
    "excited",
    "exclamation",
    "excuses",
    "exercise",
    "exist",
    "expectation",
    "experience",
    "experienced",
    "experiment",
    "expert",
    "explain",
    "explode",
    "exploit",
    "explore",
    "explosive",
    "expound",
    "express",
    "expression",
    "expressionless",
    "exquisite",
    "extend",
    "extension",
    "extent",
    "exterior",
    "extinguish",
    "extract",
    "extramarital",
    "extreme",
    "extremely",
    "extricate",
    "eyes",
    "face",
    "facing",
    "fact",
    "facts",
    "fail",
    "failure",
    "faint",
    "fair",
    "fairy",
    "faithfully",
    "fall",
    "fallen",
    "false",
    "familiar",
    "family",
    "famous",
    "fan",
    "fans",
    "far",
    "farther",
    "fascinated",
    "fascination",
    "fashion",
    "fashionable",
    "fast",
    "fastidious",
    "fate",
    "father",
    "fault",
    "favor",
    "favorite",
    "fear",
    "feature",
    "featured",
    "feed",
    "feel",
    "feeling",
    "feelings",
    "feet",
    "female",
    "feminine",
    "festival",
    "few",
    "fictitious",
    "fiddle",
    "field",
    "fierce",
    "fiercely",
    "fight",
    "figure",
    "figured",
    "file",
    "fill",
    "filled",
    "final",
    "finally",
    "finals",
    "financial",
    "find",
    "fine",
    "finger",
    "finish",
    "fire",
    "fireworks",
    "first",
    "fish",
    "fishing",
    "fitness",
    "fix",
    "flavor",
    "fleeing",
    "flesh",
    "floral",
    "flourishing",
    "flow",
    "flower",
    "flowers",
    "flustered",
    "fly",
    "focal",
    "focus",
    "follow",
    "followed",
    "followers",
    "following",
    "fondness",
    "font",
    "food",
    "fool",
    "foolish",
    "foot",
    "football",
    "footsteps",
    "force",
    "forefront",
    "forehead",
    "forest",
    "forever",
    "forgot",
    "form",
    "formal",
    "formation",
    "formidable",
    "fortune",
    "found",
    "foundation",
    "fragments",
    "fragrant",
    "fraud",
    "fraudulent",
    "free",
    "freedom",
    "freezing",
    "frequently",
    "fresh",
    "friend",
    "friends",
    "frugality",
    "full",
    "fullest",
    "function",
    "funeral",
    "furniture",
    "further",
    "fussy",
    "future",
    "gain",
    "gains",
    "gang",
    "gap",
    "garbage",
    "gather",
    "gathering",
    "gaze",
    "general",
    "generation",
    "generous",
    "gentle",
    "gentleman",
    "gently",
    "get",
    "gets",
    "gift",
    "gigolo",
    "gigolos",
    "girl",
    "girlfriend",
    "give",
    "global",
    "gnash",
    "go",
    "going",
    "good",
    "goodness",
    "got",
    "government",
    "grab",
    "grace",
    "graceful",
    "grade",
    "gradually",
    "graduate",
    "grandmother",
    "grasp",
    "grass",
    "grave",
    "graveyard",
    "great",
    "greater",
    "green",
    "grim",
    "grip",
    "groove",
    "ground",
    "group",
    "grow",
    "grows",
    "guangdong",
    "guangzhou",
    "guarantee",
    "guard",
    "guess",
    "guest",
    "guide",
    "guilt",
    "haha",
    "hair",
    "hairline",
    "half",
    "hall",
    "hand",
    "handcuffs",
    "handle",
    "hands",
    "handsome",
    "happen",
    "happenings",
    "happily",
    "happiness",
    "happy",
    "harassment",
    "harbor",
    "hard",
    "hardcore",
    "hardship",
    "hardware",
    "hardworking",
    "harm",
    "harmony",
    "harvest",
    "has",
    "hashtag",
    "hasten",
    "hate",
    "hatred",
    "have",
    "having",
    "he",
    "head",
    "headed",
    "heading",
    "headline",
    "headlines",
    "healed",
    "healthy",
    "hear",
    "heard",
    "heart",
    "heartbeat",
    "heartbroken",
    "hearted",
    "hearts",
    "heaven's",
    "heavenly",
    "heavy",
    "heeled",
    "hegemon",
    "help",
    "helpless",
    "hemp",
    "her",
    "hero",
    "hide",
    "hideout",
    "high",
    "higher",
    "hill",
    "him",
    "hire",
    "his",
    "historical",
    "history",
    "hit",
    "hitherto",
    "hold",
    "holding",
    "holiday",
    "hollow",
    "home",
    "homeland",
    "homepage",
    "hong",
    "honor",
    "honored",
    "hoodlum",
    "hoodwink",
    "hooligan",
    "hope",
    "host",
    "hosts",
    "hot",
    "housing",
    "how",
    "hub",
    "hue",
    "hug",
    "huge",
    "human",
    "humiliated",
    "humiliation",
    "humorist",
    "humorous",
    "hundred",
    "hurry",
    "hypothetical",
    "ice",
    "idea",
    "ideal",
    "identical",
    "identity",
    "idiom",
    "idiomatically",
    "idiot",
    "idol",
    "if",
    "ignorant",
    "ignore",
    "illegal",
    "illustrate",
    "immature",
    "immediately",
    "imperial",
    "implement",
    "implying",
    "import",
    "important",
    "impose",
    "impossible",
    "impression",
    "impressive",
    "imprison",
    "improvement",
    "improving",
    "incense",
    "include",
    "includes",
    "inclusion",
    "inclusive",
    "incomparably",
    "incorrectly",
    "increase",
    "incur",
    "indeed",
    "independent",
    "independently",
    "index",
    "indicate",
    "indicating",
    "indicator",
    "indifferent",
    "individual",
    "individually",
    "indulge",
    "industry",
    "inexpensive",
    "infection",
    "infectiousness",
    "infield",
    "influence",
    "informal",
    "information",
    "infuriate",
    "inherit",
    "inhuman",
    "initiative",
    "injure",
    "injury",
    "innermost",
    "innovation",
    "input",
    "inquire",
    "insert",
    "inserted",
    "insertion",
    "inside",
    "insignificant",
    "insist",
    "inspect",
    "instance",
    "instant",
    "instead",
    "institution",
    "instrument",
    "integrate",
    "integrated",
    "integrity",
    "intelligence",
    "intelligent",
    "intense",
    "intensive",
    "intention",
    "intentional",
    "intentionally",
    "interact",
    "interaction",
    "intercontinental",
    "interest",
    "interested",
    "interesting",
    "interests",
    "interior",
    "interjection",
    "interjectional",
    "internal",
    "internet",
    "interpretation",
    "interrogation",
    "interview",
    "intimate",
    "introspect",
    "invalid",
    "investigate",
    "investigation",
    "invite",
    "involving",
    "ip",
    "iron",
    "irrefutable",
    "irritable",
    "island",
    "issue",
    "jade",
    "japan",
    "japanese",
    "jerk",
    "jiangsu",
    "job",
    "jobs",
    "join",
    "joint",
    "journey",
    "joy",
    "joyfully",
    "ju",
    "juicy",
    "jump",
    "junior",
    "just",
    "justification",
    "kebabs",
    "keep",
    "key",
    "keyboard",
    "kidney",
    "kill",
    "kind",
    "kindness",
    "kinesiology",
    "kingdom",
    "knight",
    "knock",
    "knot",
    "know",
    "knowledge",
    "known",
    "kong",
    "kowtow",
    "label",
    "labor",
    "laborer",
    "lacking",
    "lady",
    "land",
    "landing",
    "landslide",
    "language",
    "large",
    "larger",
    "last",
    "late",
    "lately",
    "later",
    "laughter",
    "law",
    "layer",
    "layout",
    "lead",
    "leader",
    "leading",
    "learning",
    "leave",
    "leaves",
    "led",
    "left",
    "leg",
    "legal",
    "legend",
    "leisurely",
    "lest",
    "let",
    "letter",
    "letters",
    "level",
    "liberty",
    "lie",
    "life",
    "lifelike",
    "lift",
    "light",
    "lighting",
    "lightly",
    "lights",
    "like",
    "likes",
    "limit",
    "limitless",
    "lines",
    "linger",
    "link",
    "lip",
    "list",
    "listen",
    "lit",
    "literacy",
    "literal",
    "literally",
    "literary",
    "little",
    "live",
    "lively",
    "local",
    "location",
    "lock",
    "locksmith",
    "lofty",
    "log",
    "loneliness",
    "lonely",
    "long",
    "longer",
    "look",
    "looks",
    "lord",
    "lose",
    "losses",
    "love",
    "lovers",
    "luck",
    "lumbar",
    "lust",
    "madam",
    "magazine",
    "magic",
    "magical",
    "main",
    "mainland",
    "maintain",
    "major",
    "majority",
    "make",
    "makeup",
    "male",
    "man",
    "management",
    "manifest",
    "manifestation",
    "mankind",
    "manpower",
    "many",
    "marker",
    "marriage",
    "married",
    "marry",
    "mask",
    "massacre",
    "masses",
    "master",
    "master's",
    "match",
    "matchmaker",
    "maternal",
    "matter",
    "matters",
    "mature",
    "may",
    "me",
    "meal",
    "mean",
    "meaning",
    "means",
    "measure",
    "measure-word",
    "mechanism",
    "media",
    "medium",
    "meet",
    "melt",
    "member",
    "membrane",
    "memorable",
    "memorial",
    "memories",
    "memory",
    "merchandise",
    "merciless",
    "mercury",
    "mere",
    "merely",
    "merit",
    "mesmerize",
    "message",
    "metaphor",
    "metaphorical",
    "method",
    "meticulous",
    "michelin",
    "microblog",
    "microcontrollers",
    "middle",
    "mighty",
    "mild",
    "military",
    "milliliters",
    "mind",
    "mini",
    "minister",
    "miracle",
    "mirror",
    "misfortune",
    "mishap",
    "misinterpret",
    "misleading",
    "miss",
    "missing",
    "mission",
    "mist",
    "mistake",
    "misunderstand",
    "misunderstanding",
    "mix",
    "mixed",
    "mock",
    "modal-verb",
    "model",
    "modest",
    "module",
    "moment",
    "money",
    "monopolize",
    "month",
    "moon",
    "moonlight",
    "mordas",
    "more",
    "morning",
    "mortgage",
    "moss",
    "most",
    "mother",
    "motto",
    "mountain",
    "mountains",
    "mourn",
    "mouth",
    "movement",
    "movie",
    "mp3",
    "mr",
    "ms",
    "much",
    "muddle",
    "muddy",
    "murder",
    "muscle",
    "muscles",
    "music",
    "must",
    "muster",
    "mutton",
    "my",
    "myanmar",
    "nagging",
    "naive",
    "naked",
    "name",
    "nanjing",
    "national",
    "natural",
    "nature",
    "naughty",
    "necessarily",
    "neck",
    "necktie",
    "need",
    "negative",
    "neglect",
    "nervous",
    "netherworld",
    "network",
    "networking",
    "never",
    "nevertheless",
    "new",
    "news",
    "ng",
    "ngsh",
    "night",
    "nine",
    "no",
    "nocturne",
    "nod",
    "nonsensical",
    "normal",
    "northern",
    "nose",
    "not",
    "notch",
    "note",
    "noted",
    "nothing",
    "nothingness",
    "noun",
    "noun-phrase",
    "noun/adjective",
    "noun/verb",
    "now",
    "nowadays",
    "nr",
    "nti",
    "number",
    "numbers",
    "numeral",
    "numeral-+-measure-word",
    "nurture",
    "nutrition",
    "ny",
    "object",
    "objects",
    "obsessed",
    "obstacle",
    "obstinate",
    "obstructed",
    "obtain",
    "obtained",
    "obvious",
    "obviousness",
    "occasion",
    "occupation",
    "occur",
    "off",
    "offender",
    "offer",
    "official",
    "officialdom",
    "offstage",
    "often",
    "oh",
    "ok",
    "okay",
    "old",
    "once",
    "one's",
    "oneself",
    "online",
    "onlook",
    "only",
    "onomatopoeia",
    "open",
    "operate",
    "operations",
    "opinion",
    "opponent",
    "opposite",
    "option",
    "order",
    "ordinary",
    "organ",
    "organization",
    "organize",
    "organs",
    "oriented",
    "origin",
    "original",
    "originality",
    "other",
    "others",
    "otherwise",
    "ought",
    "our",
    "out",
    "outline",
    "outrageously",
    "outright",
    "outside",
    "outstanding",
    "outward",
    "over",
    "overbearing",
    "overcast",
    "overcoat",
    "overcome",
    "overhead",
    "overlord",
    "oversight",
    "overthrow",
    "overturn",
    "own",
    "page",
    "paid",
    "pain",
    "painful",
    "palace",
    "palm",
    "pampered",
    "panda",
    "pandemic",
    "panel",
    "panicked",
    "paper",
    "paradise",
    "parallel",
    "paris",
    "park",
    "part",
    "participate",
    "participated",
    "particle",
    "particular",
    "parties",
    "parting",
    "partner",
    "party",
    "pass",
    "passes",
    "pasture",
    "path",
    "pathway",
    "patient",
    "pay",
    "peace",
    "peaceful",
    "pen",
    "people",
    "percent",
    "perfect",
    "perfection",
    "perform",
    "performance",
    "performer",
    "perfume",
    "period",
    "periodical",
    "peripheral",
    "perish",
    "permission",
    "permutation",
    "persist",
    "person",
    "persona",
    "personal",
    "personality",
    "personally",
    "persons",
    "persuade",
    "pervert",
    "pester",
    "petal",
    "petite",
    "phd",
    "phenomenon",
    "phoenix",
    "photo",
    "phrase",
    "piano",
    "pick",
    "picky",
    "pictograph",
    "pile",
    "pinnacle",
    "pioneering",
    "pit",
    "pitch",
    "pity",
    "place",
    "places",
    "plan",
    "plant",
    "play",
    "pleased",
    "pleasing",
    "pleasure",
    "plunder",
    "poignant",
    "point",
    "poised",
    "poison",
    "police",
    "polite",
    "pop",
    "popular",
    "portion",
    "position",
    "possess",
    "possessive",
    "possessive-particle",
    "possessive-pronoun",
    "possessive-pronoun-+-measure-word",
    "possibility",
    "possible",
    "postgraduate",
    "postpone",
    "posts",
    "posture",
    "pot",
    "poverty",
    "power",
    "powerful",
    "practice",
    "precedent",
    "precisely",
    "precondition",
    "predetermined",
    "prefix",
    "premise",
    "premium",
    "preoccupied",
    "preparation",
    "preposition",
    "present",
    "press",
    "pressure",
    "pretend",
    "pretentious",
    "pretty",
    "previous",
    "previously",
    "price",
    "primary",
    "prime",
    "prince",
    "princess",
    "principal",
    "principle",
    "print",
    "prison",
    "privacy",
    "private",
    "privately",
    "probably",
    "problems",
    "proceed",
    "process",
    "processing",
    "processor",
    "product",
    "products",
    "profession",
    "professional",
    "professor",
    "profile",
    "program",
    "programmer",
    "programming",
    "progress",
    "project",
    "prominent",
    "pronoun",
    "proper",
    "proper-noun",
    "property",
    "proportion",
    "proposal",
    "propose",
    "prosper",
    "prosperous",
    "protect",
    "protecting",
    "protection",
    "proud",
    "province",
    "provoke",
    "public",
    "publication",
    "publish",
    "pull",
    "punish",
    "pure",
    "pursue",
    "push",
    "put",
    "qi",
    "qualities",
    "quality",
    "question",
    "questionnaire",
    "questions",
    "quiet",
    "quietly",
    "quietness",
    "quite",
    "race",
    "racetrack",
    "radical",
    "rage",
    "rain",
    "raise",
    "rambling",
    "random",
    "range",
    "ranking",
    "rapid",
    "rapidly",
    "rare",
    "rate",
    "rather",
    "ratio",
    "reach",
    "read",
    "readiness",
    "real",
    "reality",
    "realization",
    "realize",
    "realized",
    "really",
    "realm",
    "reap",
    "reason",
    "rebirth",
    "rebuild",
    "receive",
    "recent",
    "recently",
    "recklessly",
    "recognize",
    "recollection",
    "recommend",
    "record",
    "recover",
    "rectify",
    "red",
    "redemption",
    "reduce",
    "reeds",
    "refer",
    "referee",
    "referring",
    "refers",
    "refined",
    "reflect",
    "reflection",
    "reform",
    "refresh",
    "refuse",
    "regarding",
    "regardless",
    "regeneration",
    "register",
    "registration",
    "regret",
    "regretful",
    "reinstall",
    "related",
    "relationship",
    "relationships",
    "relatively",
    "relax",
    "relevant",
    "reliable",
    "relieve",
    "religion",
    "rely",
    "relying",
    "remarkable",
    "remember",
    "remind",
    "reminisce",
    "remorse",
    "remote",
    "remove",
    "renew",
    "rent",
    "repair",
    "repay",
    "repeated",
    "repetitiveness",
    "replace",
    "report",
    "representing",
    "repression",
    "request",
    "require",
    "research",
    "reserved",
    "reside",
    "resign",
    "resist",
    "resources",
    "respect",
    "respond",
    "response",
    "responsibilities",
    "responsibility",
    "rest",
    "restaurant",
    "restore",
    "restrained",
    "restrict",
    "result",
    "resultative",
    "results",
    "retain",
    "retreat",
    "retrograde",
    "return",
    "revenue",
    "review",
    "revolution",
    "reward",
    "rhinoceros",
    "rhyme",
    "rid",
    "right",
    "rights",
    "rise",
    "risk",
    "risks",
    "rival",
    "road",
    "rogue",
    "role",
    "roller",
    "romance",
    "romantic",
    "roof",
    "roommate",
    "root",
    "rose",
    "rotation",
    "rotten",
    "round",
    "rounds",
    "ruffian",
    "ruins",
    "rumor",
    "run",
    "running",
    "runny",
    "rush",
    "rushing",
    "ruthless",
    "ruthlessly",
    "sad",
    "sadly",
    "safeguard",
    "safety",
    "saga",
    "sagacious",
    "sake",
    "salty",
    "salute",
    "salvation",
    "same",
    "sap",
    "satisfactory",
    "save",
    "say",
    "scale",
    "scare",
    "scattered",
    "scene",
    "scenery",
    "scented",
    "schedule",
    "scheme",
    "school",
    "science",
    "sciences",
    "scientific",
    "scold",
    "scope",
    "scorer",
    "scotland",
    "scrambling",
    "scratch",
    "script",
    "scrolling",
    "scrub",
    "scrutinize",
    "scumbag",
    "sea",
    "seal",
    "search",
    "season",
    "seat",
    "secluded",
    "second",
    "secret",
    "secular",
    "security",
    "see",
    "seek",
    "seine",
    "seize",
    "select",
    "selection",
    "self",
    "sell",
    "send",
    "sensation",
    "sense",
    "sensitive",
    "sentence",
    "separated",
    "separates",
    "series",
    "serious",
    "servant",
    "serve",
    "service",
    "set",
    "setbacks",
    "setting",
    "seven",
    "several",
    "severe",
    "severely",
    "sex",
    "sexual",
    "sh",
    "shade",
    "shaded",
    "shadow",
    "shake",
    "shall",
    "shape",
    "share",
    "sharp",
    "shatter",
    "shift",
    "shine",
    "shock",
    "shoes",
    "shoot",
    "shop",
    "shopping",
    "short",
    "should",
    "shoulder",
    "shout",
    "show",
    "shy",
    "side",
    "sigh",
    "sign",
    "significant",
    "signify",
    "silently",
    "silly",
    "similar",
    "simple",
    "simply",
    "simultaneous",
    "since",
    "single",
    "singleness",
    "sink",
    "sir",
    "sister",
    "site",
    "situation",
    "sixth",
    "skewers",
    "skill",
    "skills",
    "skin",
    "skip",
    "sky",
    "slang",
    "slaughter",
    "slave",
    "sleep",
    "slick",
    "slide",
    "slightly",
    "slip",
    "slot",
    "sly",
    "smart",
    "smash",
    "smile",
    "smooth",
    "sneak",
    "snow",
    "so",
    "soar",
    "sober",
    "soccer",
    "social",
    "socializing",
    "society",
    "soft",
    "software",
    "soil",
    "solar",
    "sole",
    "solemn",
    "solstice",
    "solve",
    "some",
    "someone",
    "someone's",
    "something",
    "song",
    "soon",
    "sorcerer",
    "sorrow",
    "sorrowful",
    "sorry",
    "sort",
    "soul",
    "sound",
    "space",
    "span",
    "speak",
    "special",
    "specific",
    "spend",
    "spending",
    "spine",
    "spirit",
    "spiritual",
    "split",
    "spoil",
    "sports",
    "spot",
    "spread",
    "sprout",
    "staff",
    "stage",
    "stammer",
    "stand",
    "standard",
    "standing",
    "starred",
    "stars",
    "start",
    "started",
    "state",
    "station",
    "stature",
    "status",
    "staunch",
    "stay",
    "stem",
    "step",
    "steps",
    "steve",
    "stickiness",
    "still",
    "stillness",
    "stimulate",
    "stir",
    "stole",
    "stop",
    "store",
    "stories",
    "storm",
    "stormy",
    "story",
    "stranger",
    "strategies",
    "strategist",
    "strategy",
    "stream",
    "street",
    "strength",
    "strengthen",
    "strengthening",
    "stress",
    "strict",
    "strike",
    "strive",
    "strong",
    "strongest",
    "struck",
    "structure",
    "structures",
    "struggle",
    "stubborn",
    "student",
    "studies",
    "study",
    "stunning",
    "stupid",
    "stutter",
    "style",
    "subject",
    "subjects",
    "sublime",
    "submit",
    "substance",
    "substantial",
    "substitute",
    "succeed",
    "successful",
    "successively",
    "such",
    "sudden",
    "suddenly",
    "suffer",
    "suffering",
    "sufficient",
    "suggest",
    "suggestion",
    "sui",
    "suicide",
    "suit",
    "suitable",
    "sum",
    "summon",
    "sun",
    "sunday",
    "sunlight",
    "super",
    "superficial",
    "superlative",
    "superstar",
    "support",
    "supporter",
    "supporters",
    "suppress",
    "suppression",
    "sure",
    "surely",
    "surge",
    "surname",
    "surpass",
    "surprise",
    "surrender",
    "surround",
    "surroundings",
    "survey",
    "susceptible",
    "suspected",
    "sway",
    "sweat",
    "sweet",
    "swift",
    "swing",
    "switch",
    "symbolize",
    "symbolizing",
    "sympathy",
    "syndrome",
    "system",
    "systems",
    "tacit",
    "tactics",
    "tag",
    "tagline",
    "tail",
    "take",
    "taken",
    "taking",
    "tale",
    "talent",
    "talents",
    "talk",
    "talked",
    "tall",
    "tantamount",
    "taoism",
    "target",
    "task",
    "taste",
    "teacher",
    "team",
    "tears",
    "technique",
    "technology",
    "teeth",
    "telecommunications",
    "telephone",
    "television",
    "temperament",
    "tempered",
    "template",
    "temple",
    "temporarily",
    "ten",
    "tender",
    "tense",
    "term",
    "terminate",
    "test",
    "testing",
    "than",
    "thank",
    "that's",
    "their",
    "them",
    "then",
    "there",
    "therefore",
    "thermos",
    "they",
    "thicker",
    "thin",
    "thing",
    "things",
    "think",
    "thinking",
    "thoroughly",
    "though",
    "thought",
    "thoughts",
    "thousand",
    "three",
    "threshold",
    "thrive",
    "throat",
    "through",
    "thumbs",
    "thus",
    "ticket",
    "tide",
    "tie",
    "tier",
    "tiger",
    "tight",
    "tightly",
    "time",
    "time-adverb",
    "times",
    "tinker",
    "tip",
    "tiptoe",
    "tireless",
    "title",
    "toast",
    "today",
    "toe",
    "together",
    "tolerate",
    "tone",
    "too",
    "took",
    "top",
    "topic",
    "topics",
    "total",
    "touch",
    "tough",
    "tour",
    "towards",
    "town",
    "track",
    "trade",
    "traditional",
    "trajectory",
    "tranquility",
    "transformation",
    "transition",
    "translating",
    "translation",
    "transmit",
    "transplant",
    "trash",
    "travel",
    "treasure",
    "treat",
    "tree",
    "tree's",
    "trend",
    "tribute",
    "trick",
    "trip",
    "trouble",
    "troubling",
    "troupe",
    "true",
    "truly",
    "truth",
    "try",
    "tsunami",
    "tumble",
    "turn",
    "turns",
    "tweets",
    "two",
    "type",
    "typically",
    "unable",
    "unceasingly",
    "unclear",
    "unconfident",
    "under",
    "understand",
    "understanding",
    "undertake",
    "undertaking",
    "unexpected",
    "unexpectedly",
    "unflagging",
    "unforgettable",
    "unfortunately",
    "unified",
    "uniform",
    "unique",
    "unite",
    "unity",
    "universally",
    "universe",
    "university",
    "unlock",
    "unlucky",
    "unmarried",
    "unmask",
    "unmatched",
    "unparalleled",
    "unspoken",
    "untie",
    "until",
    "unvulgar",
    "unyielding",
    "up",
    "update",
    "upgrade",
    "upon",
    "upper",
    "upward",
    "us",
    "usage",
    "use",
    "useless",
    "user",
    "usually",
    "vagabond",
    "vague",
    "valentine's",
    "value",
    "various",
    "vast",
    "vehicle",
    "verb",
    "verb-phrase",
    "verb/adverb",
    "verb/noun",
    "version",
    "very",
    "vicinity",
    "video",
    "videos",
    "view",
    "views",
    "vigorous",
    "vigorously",
    "vine",
    "vinegar",
    "violate",
    "violent",
    "virtual",
    "virtue",
    "virus",
    "visage",
    "visible",
    "visit",
    "vital",
    "vitality",
    "vivacious",
    "vivid",
    "void",
    "vulture",
    "wag",
    "wait",
    "walk",
    "wall",
    "wanderer",
    "want",
    "wanted",
    "wanting",
    "wantonly",
    "war",
    "warm",
    "warrant",
    "washboard",
    "waste",
    "watch",
    "water",
    "waves",
    "way",
    "we",
    "wear",
    "wedding",
    "weekend",
    "weekly",
    "weibo",
    "weigh",
    "weight",
    "weird",
    "welcome",
    "well",
    "went",
    "what",
    "when",
    "where",
    "whereabouts",
    "which",
    "whichever",
    "whisky",
    "white",
    "whiter",
    "who",
    "whole",
    "wholeheartedly",
    "whom",
    "why",
    "wig",
    "wildly",
    "wilfully",
    "will",
    "willing",
    "willingly",
    "win",
    "wind",
    "window",
    "windowsill",
    "windstorm",
    "wing",
    "winged",
    "wings",
    "winter",
    "wipe",
    "wisdom",
    "wise",
    "wish",
    "wishes",
    "wither",
    "within",
    "without",
    "witness",
    "wolf",
    "woman",
    "women",
    "won",
    "word",
    "work",
    "worker",
    "workplace",
    "world",
    "worldwide",
    "worries",
    "worry",
    "worst",
    "worth",
    "would",
    "wow",
    "wrist",
    "write",
    "writing",
    "written",
    "wrong",
    "xi",
    "xu",
    "yang",
    "year",
    "years",
    "yet",
    "you",
    "young",
    "younger",
    "youth",
    "yu",
    "zeal",
    "zhou"
  ],
  "posList": [
    "adjective",
    "adjective/noun",
    "adverb",
    "adverb + verb",
    "adverbial phrase",
    "auxiliary verb",
    "conjunction",
    "expression",
    "idiom",
    "interjection",
    "measure word",
    "modal verb",
    "noun",
    "noun phrase",
    "noun/adjective",
    "noun/verb",
    "numeral",
    "numeral + measure word",
    "onomatopoeia",
    "particle",
    "phrase",
    "possessive particle",
    "possessive pronoun",
    "possessive pronoun + measure word",
    "prefix",
    "preposition",
    "pronoun",
    "proper noun",
    "slang",
    "superlative",
    "time adverb",
    "verb",
    "verb phrase",
    "verb/adverb",
    "verb/noun"
  ],
  "cards": [
    {
      "id": "da-shi",
      "hanzi": "大师",
      "pinyin": "Dà shī",
      "pos": "noun",
      "gloss": "master; expert",
      "status": "known",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "expert",
        "known",
        "master",
        "noun"
      ]
    },
    {
      "id": "ding-jian",
      "hanzi": "頂尖",
      "pinyin": "Dǐng jiān",
      "pos": "adjective",
      "gloss": "top-notch; pinnacle",
      "status": "learning",
      "example": "他是这个领域的顶尖专家。",
      "examplePinyin": "Tā shì zhège lǐngyù de dǐngjiān zhuānjiā.",
      "exampleEn": "He is a top expert in this field.",
      "detailsHtml": "The Chinese characters \"顶尖\" (dǐngjiān) mean \"top\" or \"elite,\" referring to someone or something that is at the highest level in a particular field or area. <br><br> **顶 (dǐng)** <br> **Meaning:** Top, peak <br> **Example Phrase:** **山顶** (shāndǐng) - \"mountain peak.\" <br> **Structure and Origin:** The character \"顶\" includes the radical \"页\" (yè, meaning \"page\" or \"head\") and \"丁\" (dīng, meaning \"nail\"), symbolizing the highest point. <br><br> **尖 (jiān)** <br> **Meaning:** Sharp, pointed <br> **Example Phrase:** **尖端** (jiānduān) - \"tip\" or \"cutting edge.\" <br> **Structure and Origin:** The character \"尖\" depicts two small points stacked, symbolizing sharpness or something at the tip. <br><br> **Usage in Sentence:** **他是这个领域的顶尖专家。** (Tā shì zhège lǐngyù de dǐngjiān zhuānjiā.) Translation: \"He is a top expert in this field.\" This sentence shows how \"顶尖\" is used to describe someone or something that is at the highest level.",
      "keywords": [
        "adjective",
        "internet",
        "learning",
        "notch",
        "pinnacle",
        "time",
        "top"
      ]
    },
    {
      "id": "guang-dong-ren",
      "hanzi": "广东人",
      "pinyin": "Guǎng dōng rén",
      "pos": "noun",
      "gloss": "people from Guangdong",
      "status": "learning",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "guangdong",
        "learning",
        "noun",
        "people"
      ]
    },
    {
      "id": "guang-zhou",
      "hanzi": "广州",
      "pinyin": "Guǎng zhōu",
      "pos": "noun",
      "gloss": "Guangzhou",
      "status": "known",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "guangzhou",
        "known",
        "noun"
      ]
    },
    {
      "id": "ip-shu-di-jiangsu-sheng",
      "hanzi": "江苏省",
      "pinyin": "IP shǔ dì: Jiāngsū shěng",
      "pos": "phrase",
      "gloss": "IP location: Jiangsu Province",
      "status": "known",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "ip",
        "jiangsu",
        "known",
        "location",
        "phrase",
        "province"
      ]
    },
    {
      "id": "jian-yang-di",
      "hanzi": "简炀帝",
      "pinyin": "Jiǎn Yáng dì",
      "pos": "noun",
      "gloss": "Emperor Yang of Sui",
      "status": "learning",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "emperor",
        "learning",
        "noun",
        "sui",
        "yang"
      ]
    },
    {
      "id": "mi-qi-lin-can",
      "hanzi": "米其林餐",
      "pinyin": "Mǐ qí lín cān",
      "pos": "noun",
      "gloss": "Michelin-starred meal; Michelin-starred restaurant",
      "status": "known",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "food",
        "known",
        "meal",
        "michelin",
        "noun",
        "restaurant",
        "starred"
      ]
    },
    {
      "id": "nan-jing",
      "hanzi": "南京",
      "pinyin": "Nán jīng",
      "pos": "noun",
      "gloss": "Nanjing",
      "status": "known",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "known",
        "nanjing",
        "noun"
      ]
    },
    {
      "id": "qiao-bu-si",
      "hanzi": "乔布斯",
      "pinyin": "Qiáo bù sī",
      "pos": "proper noun",
      "gloss": "Jobs (referring to Steve Jobs)",
      "status": "learning",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "jobs",
        "learning",
        "proper-noun",
        "referring",
        "steve",
        "work"
      ]
    },
    {
      "id": "riben",
      "hanzi": "日本",
      "pinyin": "Rìběn",
      "pos": "proper noun",
      "gloss": "Japan",
      "status": "known",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "japan",
        "known",
        "proper-noun"
      ]
    },
    {
      "id": "su-ge-lan",
      "hanzi": "苏格兰",
      "pinyin": "Sū gé lán",
      "pos": "noun",
      "gloss": "Scotland",
      "status": "learning",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "learning",
        "noun",
        "scotland"
      ]
    },
    {
      "id": "xiang-gang",
      "hanzi": "香港",
      "pinyin": "Xiāng gǎng",
      "pos": "noun",
      "gloss": "Hong Kong",
      "status": "known",
      "example": "香港是一个国际化的大都市。",
      "examplePinyin": "Xiānggǎng shì yīgè guójì huà de dà dūshì.",
      "exampleEn": "Hong Kong is an international metropolis.",
      "detailsHtml": "The Chinese characters \"香港\" (Xiānggǎng) together mean \"Hong Kong,\" a Special Administrative Region of China known for its vibrant economy and skyline. <br><br> **香 (xiāng)** <br> **Meaning:** Fragrant, aromatic <br> **Example Phrase:** **香味** (xiāngwèi) - \"fragrance\" or \"aroma.\" <br> **Structure and Origin:** The character \"香\" combines the radical \"禾\" (hé, meaning \"grain\") on top and \"日\" (rì, meaning \"sun\") below, indicating the scent of grain drying in the sun, symbolizing fragrance. <br><br> **港 (gǎng)** <br> **Meaning:** Harbor, port <br> **Example Phrase:** **港口** (gǎngkǒu) - \"port\" or \"harbor.\" <br> **Structure and Origin:** The character \"港\" combines the radical \"氵\" (shuǐ, meaning \"water\") on the left, signifying its relation to water, and \"巷\" (hàng, meaning \"lane\" or \"alley\") on the right, originally indicating a place where water channels converge, symbolizing a harbor. <br><br> **Usage in Sentence:** **香港是一个国际化的大都市。** (Xiānggǎng shì yīgè guójì huà de dà dūshì.) Translation: \"Hong Kong is an international metropolis.\" This sentence shows how \"香港\" is used to refer to the city of Hong Kong.",
      "keywords": [
        "hong",
        "internet",
        "known",
        "kong",
        "noun",
        "time"
      ]
    },
    {
      "id": "xu-zong",
      "hanzi": "许总",
      "pinyin": "Xǔ Zǒng",
      "pos": "proper noun",
      "gloss": "Director Xu; Mr./Ms. Xu (a title)",
      "status": "learning",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "director",
        "learning",
        "mr",
        "ms",
        "proper-noun",
        "title",
        "xu"
      ]
    },
    {
      "id": "yue-cai",
      "hanzi": "粵菜",
      "pinyin": "Yuè cài",
      "pos": "noun",
      "gloss": "Cantonese cuisine",
      "status": "learning",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "cantonese",
        "cuisine",
        "learning",
        "noun"
      ]
    },
    {
      "id": "zhongguo",
      "hanzi": "中国",
      "pinyin": "Zhōngguó",
      "pos": "noun",
      "gloss": "China \"Middle Kingdom\"",
      "status": "known",
      "example": "中国是世界上人口最多的国家。",
      "examplePinyin": "Zhōngguó shì shìjiè shàng rénkǒu zuì duō de guójiā.",
      "exampleEn": "China is the most populous country in the world.",
      "detailsHtml": "The Chinese characters \"中国\" (Zhōngguó) mean \"China.\" It is the name of the country in East Asia, known for its long history and rich cultural heritage. <br><br> **中 (zhōng)** <br> **Meaning:** Middle, center <br> **Example Phrase:** **中间** (zhōngjiān) - \"middle\" or \"center.\" <br> **Structure and Origin:** The character \"中\" is a pictograph representing an arrow striking the center of a target, symbolizing the idea of being in the middle or central. It often refers to something that is balanced or positioned in the center. <br><br> **国 (guó)** <br> **Meaning:** Country, nation <br> **Example Phrase:** **国家** (guójiā) - \"country\" or \"nation.\" <br> **Structure and Origin:** The character \"国\" consists of the radical \"囗\" (wéi, meaning \"enclosure\" or \"border\") on the outside, surrounding \"玉\" (yù, meaning \"jade\" or \"precious stone\") on the inside. The enclosure represents the borders of a country, while the jade signifies something valuable, symbolizing a nation's treasures or governance. <br><br> **Usage in Sentence:** **中国是世界上人口最多的国家。** (Zhōngguó shì shìjiè shàng rénkǒu zuì duō de guójiā.) Translation: \"China is the most populous country in the world.\" This sentence illustrates how \"中国\" is used to refer to the country of China.",
      "keywords": [
        "china",
        "kingdom",
        "known",
        "middle",
        "noun",
        "time"
      ]
    },
    {
      "id": "ba",
      "hanzi": "吧",
      "pinyin": "ba",
      "pos": "particle",
      "gloss": "(used at the end of a sentence to indicate a suggestion, a request, or a command)",
      "status": "known",
      "example": "",
      "examplePinyin": "",
      "exampleEn": "",
      "detailsHtml": "",
      "keywords": [
        "command",
        "end",
        "indicate",
        "known",
        "particle",
        "request",
        "sentence",
        "suggestion"
      ]
    },
    {
      "id": "bei",
      "hanzi": "呗",
      "pinyin": "bei",
      "pos": "particle",
      "gloss": "(used at the end of a sentence to express a suggestion or a mild command)",
      "status": "known",
      "example": "你喜欢就好呗。",
      "examplePinyin": "Nǐ xǐhuān jiù hǎo bei.",
      "exampleEn": "If you like it, then fine.",
